<policy>
	<general>
		<name>Uninstall %PROD_NAME%</name>
		<enabled>true</enabled>
		<frequency>Ongoing</frequency>
		<category>
			<name>%POLICY_CATEGORY%</name>
		</category>
	</general>
	<scope>
		<!--Scope added by JSSImporter-->
	</scope>
	<package_configuration>
		<!--Package added by JSSImporter-->
	</package_configuration>
	<scripts>
    <script>
      <id>3</id>
      <name>Uninstall Application.sh</name>
      <priority>After</priority>
      <parameter4>%PROD_NAME%.app</parameter4>
    </script>
  </scripts>
	<self_service>
		<use_for_self_service>true</use_for_self_service>
		<install_button_text>Uninstall</install_button_text>
		<self_service_description>%SELF_SERVICE_DESCRIPTION%</self_service_description>
	</self_service>
	<maintenance>
		<recon>true</recon>
	</maintenance>
</policy>
