<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v1.0.4 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of EtreCheck and imports it into your JSS.</string>
	<key>Identifier</key>
	<string>com.github.TSPARR.jss.EtreCheck</string>
	<key>Input</key>
	<dict>
	<key>CATEGORY</key>
	<string>Applications</string>
	<key>GROUP_NAME</key>
	<string>Software - %NAME% - Needs Updates</string>
	<key>GROUP_TEMPLATE</key>
	<string>Smart Group Template.xml</string>
	<key>NAME</key>
	<string>EtreCheck</string>
	<key>POLICY_CATEGORY</key>
	<string>Software Updates</string>
	<key>POLICY_TEMPLATE</key>
	<string>Update Policy Template.xml</string>
	<key>SELF_SERVICE_DESCRIPTION</key>
	<string>This will update your copy to the latest version of %NAME%.</string>
	<key>SELF_SERVICE_ICON</key>
	<string>EtreCheck.png</string>
</dict>
<key>MinimumVersion</key>
<string>0.6.1</string>
<key>ParentRecipe</key>
<string>com.github.TSPARR.pkg.EtreCheck</string>
<key>Process</key>
<array>
	<dict>
		<key>Arguments</key>
		<dict>
			<key>category</key>
			<string>%CATEGORY%</string>
			<key>groups</key>
			<array>
				<dict>
					<key>name</key>
					<string>%GROUP_NAME%</string>
					<key>smart</key>
					<true/>
					<key>template_path</key>
					<string>%GROUP_TEMPLATE%</string>
				</dict>
			</array>
			<key>policy_category</key>
			<string>%POLICY_CATEGORY%</string>
			<key>policy_template</key>
			<string>%POLICY_TEMPLATE%</string>
			<key>prod_name</key>
			<string>%NAME%</string>
			<key>self_service_description</key>
			<string>%SELF_SERVICE_DESCRIPTION%</string>
			<key>self_service_icon</key>
			<string>%SELF_SERVICE_ICON%</string>
		</dict>
		<key>Processor</key>
		<string>JSSImporter</string>
	</dict>
	<dict>
		<key>Arguments</key>
		<dict>
			<key>category</key>
			<string>%CATEGORY%</string>
			<key>groups</key>
			<array>
				<dict>
					<key>name</key>
					<string>Software - %NAME% - Not Installed</string>
					<key>smart</key>
					<true/>
					<key>template_path</key>
					<string>Not Installed Smart Group Template.xml</string>
				</dict>
			</array>
			<key>policy_category</key>
			<string>Applications</string>
			<key>policy_template</key>
			<string>Policy Template.xml</string>
			<key>prod_name</key>
			<string>%NAME%</string>
			<key>self_service_description</key>
			<string>This will install the latest version of %NAME%.</string>
			<key>self_service_icon</key>
			<string>%SELF_SERVICE_ICON%</string>
		</dict>
		<key>Processor</key>
		<string>JSSImporter</string>
	</dict>
	<dict>
		<key>Arguments</key>
		<dict>
			<key>groups</key>
			<array>
				<dict>
					<key>name</key>
					<string>Software - %NAME% - Current</string>
					<key>smart</key>
					<true/>
					<key>template_path</key>
					<string>Current Smart Group Template.xml</string>
				</dict>
			</array>
			<key>pkg_path</key>
			<string></string>
			<key>policy_template</key>
			<string></string>
		</dict>
		<key>Processor</key>
		<string>JSSImporter</string>
	</dict>
	<dict>
		<key>Arguments</key>
		<dict>
			<key>groups</key>
			<array>
				<dict>
					<key>name</key>
					<string>Software - %NAME% - Needs Updates</string>
					<key>smart</key>
					<true/>
					<key>template_path</key>
					<string>Smart Group Template.xml</string>
				</dict>
				<dict>
					<key>name</key>
					<string>Software - %NAME% - Current</string>
					<key>smart</key>
					<true/>
					<key>template_path</key>
					<string>Current Smart Group Template.xml</string>
				</dict>
			</array>
			<key>scripts</key>
			<dict/>
			<key>policy_category</key>
			<string>Uninstall</string>
			<key>policy_template</key>
			<string>Uninstall Policy Template.xml</string>
			<key>prod_name</key>
			<string>%NAME%</string>
			<key>self_service_description</key>
			<string>Having trouble with %NAME% or just no longer using it? This will completely remove it from your computer.</string>
			<key>self_service_icon</key>
			<string>Uninstall EtreCheck.png</string>
		</dict>
		<key>Processor</key>
		<string>JSSImporter</string>
	</dict>
</array>
</dict>
</plist>
