<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads pgAdmin4 and imports into Munki.</string>
	<key>Identifier</key>
	<string>com.github.TSPARR.pgAdmin4.munki</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>PGAdmin4</string>
		<key>NAME</key>
		<string>pgAdmin4</string>
		<key>APP_DESTINATION</key>
		<string>/Applications</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>ENCORE</string>
			</array>
			<key>description</key>
			<string>pgAdmin is the leading graphical Open Source management, development and administration tool for PostgreSQL.</string>
            <key>display_name</key>
            <string>pgAdmin4 - Postgresql GUI tools</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>category</key>
			<string>Developer Tools</string>
			<key>developer</key>
			<string>PostgreSQL Global Development Group</string>
		</dict>
	</dict>
    <key>ParentRecipe</key>
    <string>com.github.TSPARR.pgAdmin4.download</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
				<key>additional_makepkginfo_options</key>
				<array>
					<string>--destinationpath</string>
					<string>%APP_DESTINATION%</string>
				</array>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
