<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>This recipe downloads and imports the full installer pkg for Microsoft InTune Company Portal into Munki

	This is accomplished via the Office 365 recipes from rtrouton-recipes.

    These in turn, utilise the fwlink's found on macadmins.software</string>
    <key>Identifier</key>
    <string>com.github.TSPARR.munki.MicrosoftInTuneCompanyPortal</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>MicrosoftIntuneCompanyPortal</string>
        <key>PRODUCTID</key>
        <string>869655</string>
        <key>DOWNLOADURL</key>
        <string>https://go.microsoft.com/fwlink/?linkid=%PRODUCTID%</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/%NAME%</string>
        <key>MINIMUM_OS_VERSION</key>
        <string>10.12.0</string>
        <key>pkginfo</key>
        <dict>
            <key>blocking_applications</key>
            <array>
                <string>Microsoft Auto Update</string>
                <string>Microsoft Error Reporting</string>
                <string>Company Portal</string>
            </array>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Microsoft Intune helps organizations manage access to corporate apps, data, and resources. Company Portal is the app that lets you, as an employee of your company, securely access those resources.</string>
            <key>display_name</key>
            <string>Microsoft InTune Company Portal</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
            <key>unattended_uninstall</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>ParentRecipe</key>
    <string>com.github.rtrouton.pkg.MicrosoftIntuneCompanyPortal</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
            <key>Arguments</key>
            <dict>
                <key>additional_pkginfo</key>
                <dict>
                    <key>minimum_os_version</key>
                    <string>%MINIMUM_OS_VERSION%</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pkg_path%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
