<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>
This AutoPkg recipe was created using JSSRecipeCreator:
https://github.com/sheagcraig/JSSRecipeCreator

It is meant to be used with JSSImporter:
https://github.com/sheagcraig/JSSImporter

For tips on integrating JSSImporter into your Casper environment, check out Auto Update Magic:
https://github.com/homebysix/auto-update-magic</string>
	<key>Description</key>
	<string>Downloads the latest version of Slack and makes a pkg of it
 Then, uploads to the JSS.</string>
	<key>Identifier</key>
	<string>com.github.TSPARR.jss.slack</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Applications</string>
		<key>GROUP_NAME</key>
		<string>Software - %NAME% - Needs Updates</string>
		<key>GROUP_TEMPLATE</key>
		<string>Smart Group Template.xml</string>
		<key>NAME</key>
		<string>Slack</string>
		<key>POLICY_CATEGORY</key>
		<string>Apps</string>
		<key>POLICY_TEMPLATE</key>
		<string>Update Policy Template.xml</string>
		<key>SELF_SERVICE_DESCRIPTION</key>
		<string>Slack brings all your communication together in one place. It's real-time messaging, archiving and search for modern teams.</string>
		<key>SELF_SERVICE_ICON</key>
		<string>Slack.png</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.killahquam.pkg.slack</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category</key>
				<string>%CATEGORY%</string>
				<key>groups</key>
				<array>
					<dict>
						<key>name</key>
						<string>%GROUP_NAME%</string>
						<key>smart</key>
						<true/>
						<key>template_path</key>
						<string>%GROUP_TEMPLATE%</string>
					</dict>
				</array>
				<key>policy_category</key>
				<string>%POLICY_CATEGORY%</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE%</string>
				<key>prod_name</key>
				<string>%NAME%</string>
				<key>self_service_description</key>
				<string>%SELF_SERVICE_DESCRIPTION%</string>
				<key>self_service_icon</key>
				<string>%SELF_SERVICE_ICON%</string>
			</dict>
			<key>Processor</key>
			<string>JSSImporter</string>
		</dict>
	</array>
</dict>
</plist>
