<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest Microsoft OneNote disk image, converts it to a pkg, and imports into FileWave.</string>
	<key>Identifier</key>
	<string>com.github.TSPARR.filewave.MicrosoftOneNote</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Microsoft OneNote</string>
    <key>fw_app_bundle_id</key>
    <string>com.github.TSPARR.filewave.MicrosoftOneNote</string>
		<key>fw_fileset_group</key>
		<string>Latest Microsoft OneNote</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.download.MSOneNote2016</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unpacked</string>
				<key>flat_pkg_path</key>
				<string>%pathname%</string>
				<key>purge_destination</key>
				<true/>
				<key>skip_payload</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>FlatPkgUnpacker</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pattern</key>
				<string>%RECIPE_CACHE_DIR%/unpacked/*.pkg/PackageInfo</string>
			</dict>
			<key>Processor</key>
			<string>FileFinder</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>packageinfo_path</key>
				<string>%found_filename%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.jss-recipes.MSOffice2016VersionChecker/MSOffice2016VersionChecker</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>fw_app_version</key>
				<string>%version%</string>
				<key>fw_fileset_name</key>
				<string>%NAME% - %version%</string>
				<key>fw_import_source</key>
				<string>%pathname%</string>
			</dict>
			<key>Comment</key>
			<string>Import the Microsoft OneNote pkg into FileWave</string>
			<key>Processor</key>
			<string>com.github.autopkg.filewave.FWTool/FileWaveImporter</string>
		</dict>
	</array>
</dict>
</plist>
