<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest version of Adium and builds an Apple installer pkg. Then, uploads to the JSS.</string>
	<key>Identifier</key>
	<string>com.github.TSPARR.jss.Adium</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Applications</string>
		<key>GROUP_NAME</key>
		<string>Software - %NAME% - Needs Updates</string>
		<key>GROUP_TEMPLATE</key>
		<string>Smart Group Template.xml</string>
		<key>NAME</key>
		<string>Adium</string>
		<key>POLICY_CATEGORY</key>
		<string>Software Updates</string>
		<key>POLICY_TEMPLATE</key>
		<string>Update Policy Template.xml</string>
		<key>SELF_SERVICE_DESCRIPTION</key>
		<string>Popular instant messaging client supports a plethora of services.</string>
		<key>SELF_SERVICE_ICON</key>
		<string>Adium.png</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.pkg.Adium</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category</key>
				<string>%CATEGORY%</string>
				<key>groups</key>
				<array>
					<dict>
						<key>name</key>
						<string>%GROUP_NAME%</string>
						<key>smart</key>
						<true/>
						<key>template_path</key>
						<string>%GROUP_TEMPLATE%</string>
					</dict>
				</array>
				<key>policy_category</key>
				<string>%POLICY_CATEGORY%</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE%</string>
				<key>prod_name</key>
				<string>%NAME%</string>
				<key>self_service_description</key>
				<string>%SELF_SERVICE_DESCRIPTION%</string>
				<key>self_service_icon</key>
				<string>%SELF_SERVICE_ICON%</string>
			</dict>
			<key>Processor</key>
			<string>JSSImporter</string>
		</dict>
	</array>
</dict>
</plist>
