<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>Description</key>
    <string>Uses parent pkg recipe to download latest Malwarebytes Anti-Malware and import it into the JSS.</string>
    <key>Identifier</key>
    <string>com.github.TSPARR.jss.MalwarebytesAntiMalware</string>
    <key>Input</key>
    <dict>
      <key>NAME</key>
      <string>MalwarebytesAnti-Malware</string>
      <key>PROD_NAME</key>
      <string>Malwarebytes Anti-Malware</string>
      <key>CATEGORY</key>
      <string>First Aid</string>
      <key>POLICY_CATEGORY</key>
      <string>Software Updates</string>
      <key>POLICY_TEMPLATE</key>
      <string>Update Policy Template.xml</string>
      <key>SELF_SERVICE_ICON</key>
      <string>Malwarebytes Anti-Malware.png</string>
      <key>GROUP_TEMPLATE</key>
      <string>Smart Group Template.xml</string>
      <key>GROUP_NAME</key>
      <string>Software - %PROD_NAME% - Needs Updates</string>
      <key>SELF_SERVICE_DESCRIPTION</key>
      <string>This will update your copy to the latest version of %PROD_NAME%.</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>ParentRecipe</key>
    <string>com.github.TSPARR.pkg.MalwarebytesAntiMalware</string>
    <key>Process</key>
    <array>
      <dict>
        <key>Arguments</key>
        <dict>
          <key>prod_name</key>
          <string>%PROD_NAME%</string>
          <key>category</key>
          <string>%CATEGORY%</string>
          <key>policy_category</key>
          <string>%POLICY_CATEGORY%</string>
          <key>policy_template</key>
          <string>%POLICY_TEMPLATE%</string>
          <key>self_service_icon</key>
          <string>%SELF_SERVICE_ICON%</string>
          <key>self_service_description</key>
          <string>%SELF_SERVICE_DESCRIPTION%</string>
          <key>groups</key>
          <array>
            <dict>
              <key>name</key>
              <string>%GROUP_NAME%</string>
              <key>smart</key>
              <true/>
              <key>template_path</key>
              <string>%GROUP_TEMPLATE%</string>
            </dict>
          </array>
        </dict>
        <key>Processor</key>
        <string>JSSImporter</string>
      </dict>
      <dict>
        <key>Arguments</key>
        <dict>
          <key>category</key>
          <string>%CATEGORY%</string>
          <key>groups</key>
          <array>
            <dict>
              <key>name</key>
              <string>Software - %PROD_NAME% - Not Installed</string>
              <key>smart</key>
              <true/>
              <key>template_path</key>
              <string>Not Installed Smart Group Template.xml</string>
            </dict>
          </array>
          <key>policy_category</key>
          <string>First Aid</string>
          <key>policy_template</key>
          <string>Policy Template.xml</string>
          <key>prod_name</key>
          <string>%PROD_NAME%</string>
          <key>self_service_description</key>
          <string>Malwarebytes for Mac crushes viruses, adware, ransomware, and other Mac malware, so you are protected and your Mac keeps running like a Mac.</string>
          <key>self_service_icon</key>
          <string>%SELF_SERVICE_ICON%</string>
        </dict>
        <key>Processor</key>
        <string>JSSImporter</string>
      </dict>
    </array>
  </dict>
</plist>
