<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>Comment</key>
    <string>Created with Recipe Robot v1.0.4 (https://github.com/homebysix/recipe-robot)</string>
    <key>Description</key>
    <string>Downloads the latest version of Angry IP Scanner and imports it into your JSS.</string>
    <key>Identifier</key>
    <string>com.github.TSPARR.jss.AngryIPScanner</string>
    <key>Input</key>
    <dict>
      <key>CATEGORY</key>
      <string>Applications</string>
      <key>GROUP_NAME</key>
      <string>Software - %PROD_NAME% - Needs Updates</string>
      <key>GROUP_TEMPLATE</key>
      <string>Smart Group Template.xml</string>
      <key>NAME</key>
      <string>AngryIPScanner</string>
      <key>PROD_NAME</key>
      <string>Angry IP Scanner</string>
      <key>POLICY_CATEGORY</key>
      <string>Software Updates</string>
      <key>POLICY_TEMPLATE</key>
      <string>Update Policy Template.xml</string>
      <key>SELF_SERVICE_DESCRIPTION</key>
      <string>Install the latest version of %PROD_NAME%.</string>
      <key>SELF_SERVICE_ICON</key>
      <string>Angry IP Scanner.png</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>ParentRecipe</key>
    <string>com.github.TSPARR.pkg.AngryIPScanner</string>
    <key>Process</key>
    <array>
      <dict>
        <key>Arguments</key>
        <dict>
          <key>category</key>
          <string>%CATEGORY%</string>
          <key>groups</key>
          <array>
            <dict>
              <key>name</key>
              <string>%GROUP_NAME%</string>
              <key>smart</key>
              <true/>
              <key>template_path</key>
              <string>%GROUP_TEMPLATE%</string>
            </dict>
          </array>
          <key>policy_category</key>
          <string>%POLICY_CATEGORY%</string>
          <key>policy_template</key>
          <string>%POLICY_TEMPLATE%</string>
          <key>prod_name</key>
          <string>%PROD_NAME%</string>
          <key>self_service_description</key>
          <string>%SELF_SERVICE_DESCRIPTION%</string>
          <key>self_service_icon</key>
          <string>%SELF_SERVICE_ICON%</string>
        </dict>
        <key>Processor</key>
        <string>JSSImporter</string>
      </dict>
      <dict>
        <key>Arguments</key>
        <dict>
          <key>category</key>
          <string>%CATEGORY%</string>
          <key>groups</key>
          <array>
            <dict>
              <key>name</key>
              <string>Software - %PROD_NAME% - Not Installed</string>
              <key>smart</key>
              <true/>
              <key>template_path</key>
              <string>Not Installed Smart Group Template.xml</string>
            </dict>
          </array>
          <key>policy_category</key>
          <string>Admin Software</string>
          <key>policy_template</key>
          <string>Policy Template.xml</string>
          <key>prod_name</key>
          <string>%PROD_NAME%</string>
          <key>self_service_description</key>
          <string>Angry IP scanner is a very fast IP address and port scanner</string>
          <key>self_service_icon</key>
          <string>%SELF_SERVICE_ICON%</string>
        </dict>
        <key>Processor</key>
        <string>JSSImporter</string>
      </dict>
    </array>
  </dict>
</plist>
