<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads Adobe Flash Player installer and extracts the embedded package, uploads to JSS.</string>
	<key>Identifier</key>
	<string>com.github.TSPARR.jss.AdobeFlashPlayer</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Plug-Ins</string>
		<key>GROUP_NAME</key>
		<string>Plug-Ins - %NAME% - Needs Updates</string>
		<key>GROUP_TEMPLATE</key>
		<string>Automatically Update Adobe Flash Player Smart Group Template.xml</string>
		<key>NAME</key>
		<string>Adobe Flash Player</string>
		<key>POLICY_CATEGORY</key>
		<string>Plug-Ins</string>
		<key>POLICY_TEMPLATE</key>
		<string>Automatically Update Policy Template.xml</string>
		<key>SELF_SERVICE_DESCRIPTION</key>
		<string>Adobe Flash Player is freeware software for using content created on the Adobe Flash platform, including viewing multimedia, executing rich Internet applications, and streaming video and audio.</string>
		<key>SELF_SERVICE_ICON</key>
		<string>Adobe Flash Player.png</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.pkg.FlashPlayerExtractPackage</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category</key>
				<string>%CATEGORY%</string>
				<key>extension_attributes</key>
				<array>
					<dict>
						<key>ext_attribute_path</key>
						<string>Adobe Flash Player Extension Attribute.xml</string>
					</dict>
				</array>
				<key>groups</key>
				<array>
					<dict>
						<key>name</key>
						<string>%GROUP_NAME%</string>
						<key>smart</key>
						<true/>
						<key>template_path</key>
						<string>%GROUP_TEMPLATE%</string>
					</dict>
				</array>
				<key>policy_category</key>
				<string>%POLICY_CATEGORY%</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE%</string>
				<key>prod_name</key>
				<string>%NAME%</string>
				<key>self_service_description</key>
				<string>%SELF_SERVICE_DESCRIPTION%</string>
				<key>self_service_icon</key>
				<string>%SELF_SERVICE_ICON%</string>
			</dict>
			<key>Processor</key>
			<string>JSSImporter</string>
		</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>category</key>
					<string>%CATEGORY%</string>
					<key>groups</key>
					<array>
						<dict>
							<key>name</key>
							<string>Plug-Ins - %NAME% - Not Installed</string>
							<key>smart</key>
							<true/>
							<key>template_path</key>
							<string>Install Adobe Flash Player Smart Group Template.xml</string>
						</dict>
					</array>
					<key>policy_category</key>
					<string>Plug-Ins</string>
					<key>policy_template</key>
					<string>Policy Template.xml</string>
					<key>prod_name</key>
					<string>%NAME%</string>
					<key>self_service_description</key>
					<string>This will install the most recent version of %NAME%.

Note: Encore Technologies does not recommend installing %NAME% unless it's needed for a critical website. Please consider using Google Chrome instead.</string>
					<key>self_service_icon</key>
					<string>%SELF_SERVICE_ICON%</string>
				</dict>
				<key>Processor</key>
				<string>JSSImporter</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>groups</key>
					<array>
						<dict>
							<key>name</key>
							<string>Plug-Ins - %NAME% - Current</string>
							<key>smart</key>
							<true/>
							<key>template_path</key>
							<string>Current Adobe Flash Player Smart Group Template.xml</string>
						</dict>
					</array>
					<key>pkg_path</key>
					<string></string>
					<key>policy_template</key>
					<string></string>
				</dict>
				<key>Processor</key>
				<string>JSSImporter</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>groups</key>
					<array>
						<dict>
							<key>name</key>
							<string>Plug-Ins - %NAME% - Needs Updates</string>
							<key>smart</key>
							<true/>
							<key>template_path</key>
							<string>Automatically Update Adobe Flash Player Smart Group Template.xml</string>
						</dict>
						<dict>
							<key>name</key>
							<string>Plug-Ins - %NAME% - Current</string>
							<key>smart</key>
							<true/>
							<key>template_path</key>
							<string>Current Adobe Flash Player Smart Group Template.xml</string>
						</dict>
					</array>
					<key>scripts</key>
					<array>
						<dict>
							<key>name</key>
							<string>Uninstall Adobe Flash Player.sh</string>
							<key>template_path</key>
							<string>Uninstall Adobe Flash Player Script Template.xml</string>
						</dict>
					</array>
					<key>policy_category</key>
					<string>Plug-Ins</string>
					<key>policy_template</key>
					<string>Uninstall Adobe Flash Player Policy Template.xml</string>
					<key>prod_name</key>
					<string>%NAME%</string>
					<key>self_service_description</key>
					<string>Having trouble with %NAME% or just no longer using it? This will completely remove it from your computer.</string>
					<key>self_service_icon</key>
					<string>Uninstall Adobe Flash Player.png</string>
				</dict>
				<key>Processor</key>
				<string>JSSImporter</string>
			</dict>
	</array>
</dict>
</plist>
