<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v1.0.4 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Installs the latest version of 3CX client.</string>
	<key>Identifier</key>
	<string>com.github.TSPARR.install.3CXclient</string>
	<key>Input</key>
	<dict>
		<key>APP_FILENAME</key>
		<string>3CXPhone</string>
		<key>NAME</key>
		<string>3CX client</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.TSPARR.pkg.3CXclient</string>
	<key>Process</key>
	<array>
			<dict>
					<key>Processor</key>
					<string>Installer</string>
			</dict>
	</array>
</dict>
</plist>
