<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Uses parent pkg recipe to download latest Google Chrome and import it into the JSS.</string>
	<key>Identifier</key>
	<string>com.github.TSPARR.sites.jss.GoogleChrome</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Applications</string>
		<key>GROUP_NAME</key>
		<string>%SITE_NAME% - Software - %PROD_NAME% - Needs Updates</string>
		<key>GROUP_TEMPLATE</key>
		<string>Smart Group Template - Site Enabled.xml</string>
		<key>NAME</key>
		<string>GoogleChrome</string>
		<key>PROD_NAME</key>
		<string>Google Chrome</string>
		<key>OS_REQUIREMENTS</key>
		<string>10.12.x,10.11.x,10.10.x,10.9.x</string>
		<key>POLICY_CATEGORY</key>
		<string>Software Updates</string>
		<key>POLICY_TEMPLATE</key>
		<string>Automatically Update Policy Template - Site Enabled.xml</string>
		<key>SITE_NAME</key>
		<string>Test</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.pkg.googlechrome</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category</key>
				<string>%CATEGORY%</string>
				<key>groups</key>
				<array>
					<dict>
						<key>name</key>
						<string>%GROUP_NAME%</string>
						<key>smart</key>
						<true/>
						<key>template_path</key>
						<string>%GROUP_TEMPLATE%</string>
					</dict>
				</array>
				<key>policy_category</key>
				<string>%POLICY_CATEGORY%</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE%</string>
				<key>prod_name</key>
				<string>%PROD_NAME%</string>
				<key>scripts</key>
				<array>
					<dict>
						<key>name</key>
						<string>Disable Google Chrome Auto-Update.sh</string>
						<key>template_path</key>
						<string>Google Chrome Script Template.xml</string>
					</dict>
				</array>
			</dict>
			<key>Processor</key>
			<string>JSSImporter</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category</key>
				<string>%CATEGORY%</string>
				<key>groups</key>
				<array>
					<dict>
						<key>name</key>
						<string>%SITE_NAME% - Software - %PROD_NAME% - Not Installed</string>
						<key>smart</key>
						<true/>
						<key>template_path</key>
						<string>Not Installed Smart Group Template - Site Enabled.xml</string>
					</dict>
				</array>
				<key>policy_category</key>
				<string>Applications</string>
				<key>policy_template</key>
				<string>Automatically Install Policy Template - Site Enabled.xml</string>
				<key>prod_name</key>
				<string>%PROD_NAME%</string>
				<key>scripts</key>
				<array>
					<dict>
						<key>name</key>
						<string>Disable Google Chrome Auto-Update.sh</string>
						<key>template_path</key>
						<string>Google Chrome Script Template.xml</string>
					</dict>
				</array>
			</dict>
			<key>Processor</key>
			<string>JSSImporter</string>
		</dict>
	</array>
</dict>
</plist>
