<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>IMPORTANT: This recipe is meant to be overridden, not run as-is.

For specific instructions, see the parent recipe's description:
https://github.com/autopkg/gregneagle-recipes/blob/master/Mozilla/FirefoxAutoconfig.pkg.recipe

Input variables have been provided below for your convenience, but are only
necessary if the value you want differs from the parent pkg recipe.
	</string>
	<key>Identifier</key>
	<string>com.github.TSPARR.sites.jss.FirefoxAutoconfig</string>
	<key>Input</key>
	<dict>
		<key>AUTOCONFIG_DIR</key>
		<string>Contents/Resources/</string>
		<key>AUTOCONFIG_FILENAME</key>
		<string>autoconfig.zip</string>
		<key>CATEGORY</key>
		<string>Applications</string>
		<key>GROUP_NAME</key>
		<string>%SITE_NAME% - Software - %PROD_NAME% - Needs Updates</string>
		<key>GROUP_TEMPLATE</key>
		<string>Smart Group Template - Site Enabled.xml</string>
		<key>LOCALE</key>
		<string>en_US</string>
		<key>NAME</key>
		<string>FirefoxESR</string>
		<key>PROD_NAME</key>
		<string>Firefox ESR</string>
		<key>ORG_NAME</key>
		<string>Customized</string>
		<key>PKG_ID</key>
		<string>org.mozilla.firefox.pkg</string>
		<key>POLICY_CATEGORY</key>
		<string>Software Updates</string>
		<key>POLICY_TEMPLATE</key>
		<string>Automatically Update Policy Template - Site Enabled.xml</string>
		<key>RELEASE</key>
		<string>latest</string>
		<key>SELF_SERVICE_DESCRIPTION</key>
		<string>This will update your copy to the latest version of %PROD_NAME%.</string>
		<key>SELF_SERVICE_ICON</key>
		<string>Firefox.png</string>
		<key>SITE_NAME</key>
		<string>Test</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>ParentRecipe</key>
	<string>com.github.gregneagle.pkg.FirefoxAutoconfig</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category</key>
				<string>%CATEGORY%</string>
				<key>groups</key>
				<array>
					<dict>
						<key>name</key>
						<string>%GROUP_NAME%</string>
						<key>smart</key>
						<true/>
						<key>template_path</key>
						<string>%GROUP_TEMPLATE%</string>
					</dict>
				</array>
				<key>policy_category</key>
				<string>%POLICY_CATEGORY%</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE%</string>
				<key>self_service_description</key>
				<string>%SELF_SERVICE_DESCRIPTION%</string>
				<key>self_service_icon</key>
				<string>%SELF_SERVICE_ICON%</string>
			</dict>
			<key>Processor</key>
			<string>JSSImporter</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category</key>
				<string>%CATEGORY%</string>
				<key>groups</key>
				<array>
					<dict>
						<key>name</key>
						<string>%SITE_NAME% - Software - %PROD_NAME% - Not Installed</string>
						<key>smart</key>
						<true/>
						<key>template_path</key>
						<string>Not Installed Smart Group Template - Site Enabled.xml</string>
					</dict>
				</array>
				<key>policy_category</key>
				<string>Applications</string>
				<key>policy_template</key>
				<string>Automatically Install Policy Template - Site Enabled.xml</string>
				<key>prod_name</key>
				<string>%PROD_NAME%</string>
				<key>self_service_description</key>
				<string>This will install the latest version of %PROD_NAME%.</string>
				<key>self_service_icon</key>
				<string>%SELF_SERVICE_ICON%</string>
			</dict>
			<key>Processor</key>
			<string>JSSImporter</string>
		</dict>
	</array>
</dict>
</plist>
