<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest Microsoft Outlook disk image, converts it to a pkg, and imports into FileWave.</string>
	<key>Identifier</key>
	<string>com.github.TSPARR.filewave.MicrosoftOutlook</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Microsoft Outlook</string>
    <key>fw_app_bundle_id</key>
    <string>com.github.TSPARR.filewave.MicrosoftOutlook</string>
		<key>fw_fileset_group</key>
		<string>Latest Microsoft Outlook</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.download.MSOutlook2016</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>fw_app_version</key>
				<string>%version%</string>
				<key>fw_fileset_name</key>
				<string>%NAME% - %version%</string>
				<key>fw_import_source</key>
				<string>%pkg_path%</string>
			</dict>
			<key>Comment</key>
			<string>Import the Microsoft Outlook pkg into FileWave</string>
			<key>Processor</key>
			<string>com.github.autopkg.filewave.FWTool/FileWaveImporter</string>
		</dict>
	</array>
</dict>
</plist>
