<policy>
	<general>
		<name>Automatically Install %PROD_NAME%</name>
		<enabled>true</enabled>
		<trigger>CHECKIN</trigger>
		<frequency>Ongoing</frequency>
		<category>
			<name>%POLICY_CATEGORY%</name>
		</category>
	</general>
	<scope>
		<!--Scope added by JSSImporter-->
	</scope>
	<package_configuration>
		<!--Package added by JSSImporter-->
	</package_configuration>
	<scripts>
      <script>
        <id>45</id>
        <name>Configure Encore Monitoring Client.sh</name>
        <priority>Before</priority>
        <parameter4>%MONITORING_GROUP%</parameter4>
        <parameter5>%AUTO_UPDATE%</parameter5>
      </script>
	</scripts>
	<self_service>
		<use_for_self_service>false</use_for_self_service>
		<install_button_text>Install</install_button_text>
		<self_service_description>%SELF_SERVICE_DESCRIPTION%</self_service_description>
	</self_service>
	<maintenance>
		<recon>true</recon>
	</maintenance>
</policy>
