<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>Description</key>
    <string>Downloads latest version of the MonitoringClient.pkg, and uploads it to the JSS. An override file is required to set the subdomain.</string>
    <key>Identifier</key>
    <string>com.github.TSPARR.sites.jss.MonitoringClient</string>
    <key>Input</key>
    <dict>
      <key>CATEGORY</key>
      <string>Plug-Ins</string>
      <key>GROUP_NAME</key>
      <string>Plug-Ins - %PROD_NAME% - Needs Updates</string>
      <key>GROUP_TEMPLATE</key>
      <string>Monitoring Client Smart Group Template - Site Enabled.xml</string>
      <key>NAME</key>
      <string>EncoreMonitoringClient</string>
      <key>PROD_NAME</key>
      <string>Encore Monitoring Client</string>
      <key>POLICY_CATEGORY</key>
      <string>Plug-Ins</string>
      <key>SUBDOMAIN</key>
      <string>www</string>
      <key>MONITORING_GROUP</key>
      <string>Default</string>
      <key>AUTO_UPDATE</key>
      <string>true</string>
      <key>POLICY_TEMPLATE</key>
      <string>Automatically Update Monitoring Client Policy Template - Site Enabled.xml</string>
      <key>SELF_SERVICE_DESCRIPTION</key>
      <string>A tool which detects issues on your Mac, and reports them to IT.</string>
      <key>SELF_SERVICE_ICON</key>
      <string>Monitoring Client.png</string>
      <key>SITE_NAME</key>
      <string>Test</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.watchmanmonitoring.download.monitoringclient</string>
    <key>Process</key>
    <array>
      <dict>
        <key>Arguments</key>
        <dict>
          <key>category</key>
          <string>%CATEGORY%</string>
          <key>extension_attributes</key>
          <array>
            <dict>
              <key>ext_attribute_path</key>
              <string>Encore Monitoring Client Extension Attribute.xml</string>
            </dict>
          </array>
          <key>groups</key>
          <array>
            <dict>
              <key>name</key>
              <string>%GROUP_NAME%</string>
              <key>smart</key>
              <true/>
              <key>template_path</key>
              <string>%GROUP_TEMPLATE%</string>
            </dict>
          </array>
          <key>policy_category</key>
          <string>%POLICY_CATEGORY%</string>
          <key>policy_template</key>
          <string>%POLICY_TEMPLATE%</string>
          <key>prod_name</key>
          <string>%PROD_NAME%</string>
          <key>self_service_description</key>
          <string>%SELF_SERVICE_DESCRIPTION%</string>
          <key>self_service_icon</key>
          <string>%SELF_SERVICE_ICON%</string>
        </dict>
        <key>Processor</key>
        <string>JSSImporter</string>
      </dict>
      <dict>
        <key>Arguments</key>
        <dict>
          <key>category</key>
          <string>%CATEGORY%</string>
          <key>groups</key>
          <array>
            <dict>
              <key>name</key>
              <string>Plug-Ins - %PROD_NAME% - Not Installed</string>
              <key>smart</key>
              <true/>
              <key>template_path</key>
              <string>Install Monitoring Client Smart Group Template - Site Enabled.xml</string>
            </dict>
          </array>
          <key>policy_category</key>
          <string>Plug-Ins</string>
          <key>policy_template</key>
          <string>Automatically Install Monitoring Client Policy Template - Site Enabled.xml</string>
          <key>prod_name</key>
          <string>%PROD_NAME%</string>
          <key>self_service_description</key>
          <string>This will install the latest version of %PROD_NAME%.</string>
          <key>self_service_icon</key>
          <string>%SELF_SERVICE_ICON%</string>
        </dict>
        <key>Processor</key>
        <string>JSSImporter</string>
      </dict>
      <dict>
        <key>Arguments</key>
        <dict>
          <key>groups</key>
          <array>
            <dict>
              <key>name</key>
              <string>Plug-Ins - %PROD_NAME% - Current</string>
              <key>smart</key>
              <true/>
              <key>template_path</key>
              <string>Current Monitoring Client Smart Group Template - Site Enabled.xml</string>
            </dict>
          </array>
          <key>pkg_path</key>
          <string></string>
          <key>policy_template</key>
          <string></string>
        </dict>
        <key>Processor</key>
        <string>JSSImporter</string>
      </dict>
    </array>
  </dict>
</plist>
